name: "ensemble"
platform: "ensemble"
max_batch_size: 8

input [
  {
    name: "input"
    data_type: TYPE_FP32
    dims: [ 3, 224, 224 ]
  }
]
output [
  {
    name: "output"
    data_type: TYPE_FP32
    dims: [ 5, 2 ]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "preprocess"
      model_version: -1
      input_map {
        key: "input"
        value: "input"
      }
      output_map {
        key: "output"
        value: "preprocessed"
      }
    },
    {
      model_name: "resnet50"
      model_version: -1
      input_map {
        key: "input"
        value: "preprocessed"
      }
      output_map {
        key: "output"
        value: "logits"
      }
    },
    {
      model_name: "postprocess"
      model_version: -1
      input_map {
        key: "input"
        value: "logits"
      }
      output_map {
        key: "output"
        value: "output"
      }
    }
  ]
} 